In [1]:
# Data Preprocessing

# Importing the libraries
    ##### for scientific computing
import numpy as np 
    ##### for data manipulation
import pandas as pd  
    ##### for 2D plotting
import matplotlib.pyplot as plt  
    ##### for data visualization also provides a high-level interface for drawing attractive and informative statistical graphics
import seaborn as sns  
    ##### messages are typically issued in situations where it is useful to alert the user of some condition in a program, where that condition (normally) doesn’t warrant raising an exception and terminating the program
import warnings  
warnings.filterwarnings('ignore')

In [2]:
# Importing the data-set

dataset = pd.read_csv('Data.csv')
dataset.head(2)

,V1,V3,V4,V5,V501,V507,V508,V509,V7101,V7112,...,V7206,V7207,V7208,V507 School region,V7532,V7533,V8527,V8528,V8529,V8531
0,2017,FORM 4:(4),54591,2.427542,8,NORTH CENTRAL:(2),ELSE:(0),NOT MSA:(0),NEVER:(1),0 OCCASIONS:(1),...,MARKED:(1),MARKED:(1),MARKED:(1),NORTH CENTRAL:(2),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8)
1,2017,FORM 1:(1),12278,0.594924,10,WEST:(4),ELSE:(0),MSA:(1),NEVER:(1),20-39X:(6),...,MARKED:(1),MARKED:(1),NOT MARKED:(0),WEST:(4),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8),NA: NOT ASKED ON THIS FORM:(-8)

In [3]:
dataset.shape

(182353, 272)

In [4]:
dataset.index

RangeIndex(start=0, stop=182353, step=1)

In [5]:
# Missing value Detection

In [9]:
dataset.isnull().sum()

V1                         0
V3                         0
V4                         0
V5                         0
V501                       0
V507                       0
V508                       0
V509                       0
V7101                      0
V7112                      0
V7115                      0
V7118                      0
V7127                      0
V7097                      0
V7133                      0
V7139                      0
V7142                      0
V7121                      0
V7124                      0
V7164                      0
V7145                      0
V7152                      0
V7155                      0
V7158                      0
V7161                      0
V7601                      0
V8480                      0
V7648                 152172
V7649                 152172
V7652                 152172
                       ...
V7312                      0
V7313                      0
V7378                      0
V7379                      0
V7380                      0
V7319                      0
V7325                      0
V7317                      0
V7318                      0
V7320                      0
V7321                      0
V7322                      0
V7323                      0
V7381                      0
V7326                      0
V7214                      0
V7239                      0
V7202                      0
V7215                      0
V7216                      1
V7206                      0
V7207                      0
V7208                      0
V507 School region         0
V7532                      0
V7533                      0
V8527                      0
V8528                      0
V8529                      0
V8531                      0
Length: 272, dtype: int64

In [10]:
# Replace the MISSING:(-9) values from dataset

In [18]:
new_df = dataset.replace('MISSING:(-9)',  np.nan)

In [20]:
new_df = new_df.replace('NA: NOT ASKED ON THIS FORM:(-8)',  np.nan)

In [55]:
new_df.isnull().sum()

V1                         0
V3                         0
V4                         0
V5                         0
V501                       0
V507                       0
V508                       0
V509                       0
V7101                   6290
V7112                   6657
V7115                   6197
V7118                   6353
V7127                   6425
V7097                  36740
V7133                   6615
V7139                  95365
V7142                  45562
V7121                   5469
V7124                   5862
V7164                  55476
V7145                   6141
V7152                  36601
V7155                  36815
V7158                   6411
V7161                 153065
V7601                 123753
V8480                 132722
V7648                 172956
V7649                 172992
V7652                 172997
                       ...
V7312                   1996
V7313                   1723
V7378                   1651
V7379                   1932
V7380                   1701
V7319                   1565
V7325                   1400
V7317                   1606
V7318                   2194
V7320                   2143
V7321                   2062
V7322                   3303
V7323                   3302
V7381                   1886
V7326                   1350
V7214                   6222
V7239                  10807
V7202                   7709
V7215                   6225
V7216                   6014
V7206                  10626
V7207                  10626
V7208                  10626
V507 School region         0
V7532                 162088
V7533                 162162
V8527                 129887
V8528                 130540
V8529                 129978
V8531                 130093
Length: 272, dtype: int64

In [22]:
new_df.count().tail()

V7533    20191
V8527    52466
V8528    51813
V8529    52375
V8531    52260
dtype: int64

In [23]:
len(new_df)

182353

In [51]:
new_df_missing_50 = (new_df.isnull().mean()*100) < 50

In [52]:
new_df_missing_50.sum()

156

In [53]:
new_df_missing_50.describe()

count      272
unique       2
top       True
freq       156
dtype: object

In [65]:
type(new_df_missing_50)

pandas.core.series.Series

In [69]:
new_df = new_df.dropna(thresh=new_df.shape[0]*0.5, how = 'all', axis =1)

In [70]:
new_df.shape

(182353, 156)

In [71]:
new_df.head(2)

,V1,V3,V4,V5,V501,V507,V508,V509,V7101,V7112,...,V7326,V7214,V7239,V7202,V7215,V7216,V7206,V7207,V7208,V507 School region
0,2017,FORM 4:(4),54591,2.427542,8,NORTH CENTRAL:(2),ELSE:(0),NOT MSA:(0),NEVER:(1),0 OCCASIONS:(1),...,5-6 HRS:(5),LT 1 HR:(2),TWO:(3),FEMALE:(2),CLG GRAD:(5),CLG GRAD:(5),MARKED:(1),MARKED:(1),MARKED:(1),NORTH CENTRAL:(2)
1,2017,FORM 1:(1),12278,0.594924,10,WEST:(4),ELSE:(0),MSA:(1),NEVER:(1),20-39X:(6),...,5-6 HRS:(5),1-2 HRS:(3),THREE:(4),MALE:(1),CLG GRAD:(5),GRAD SCH:(6),MARKED:(1),MARKED:(1),NOT MARKED:(0),WEST:(4)

In [72]:
new_df.to_csv('CleanData.csv', sep='\t')